import zhLocale from "element-ui/lib/locale/lang/zh-CN";
const cn = {
    nav: [
        '首页',
        '区块链', ' 区块', '交易', '富豪榜', ' 图表'

    ],
    transaction:['交易详情','显示更多','更多信息','选举节点的预计平均收益','流通总量'],
    search: ['搜索 地址/区块高度/TXhash'],
    index: ['区块高度', '24H交易数', '已发放奖励', '节点总数', '累计交易数', '剩余区块奖励', '最新交易', '最新出块', '更多', '从', '至'],
    block: ['区块列表', '时间', '交易笔数', '交易额', '区块奖励'],
    blockdetail: ['区块详情', '区块个数', '燃料费', '交易哈希','交易列表'],
    transactiondetail: ['交易明细','所属区块', '交易时间', '共识数', '交易签名节点', '点击查看更多', '燃料费信息', '区块奖励信息'],
    address: ['地址列表','排名', '地址', '金额', '占比'],
    addressdetail: ['地址概览','余额', '交易数', '收入合计', '支出合计',' 该地址未发生交易'],
    notfound: ['未搜索到', '你输入的', '不存在', '返回'],
    chart:['全网节点信息','挖矿奖励','交易信息','账户统计','燃料费分布图','节点','占比'],
    ...zhLocale
};

export default cn;